Documents/ЗаменаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаменаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СчетчикиБоксов</xr:Item>
				<xr:Item>InformationRegister.СчетчикиВводов</xr:Item>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
				<xr:Item>AccumulationRegister.ПотреблениеЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеСтарогоПриДемонтаже</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальноеПоказаниеНового</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДоДемонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятПрежний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаменаСчетчика/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтарыйСчетчикПриИзменении(Элемент)
    ОбновитьПодсказкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ОбновитьПодсказкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкиНаСервере()
    Если Объект.СтарыйСчетчик.Пустая() Тогда
        ПредыдущееПоказание = 0;
		Бокс = "";
        Возврат;
    КонецЕсли;
    ПредыдущееПоказание = ЭлектроУчет.ТекущееПоказаниеЧисло(Объект.СтарыйСчетчик, Объект.Дата - 1);
    Если Объект.СтарыйСчетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ИндивидуальныйПриборУчета Тогда
        Объект.Бокс = ЭлектроУчет.БоксСчетчикаНаДату(Объект.СтарыйСчетчик, Объект.Дата - 1);
    КонецЕсли;
	Если Объект.ПоказаниеСтарогоПриДемонтаже = 0 Тогда
	   Объект.ПоказаниеСтарогоПриДемонтаже = ПредыдущееПоказание; // замена без потребления
    КонецЕсли;
КонецПроцедуры
